Revit 2026 API

# ProjectInfoAddress Property

---

Get or Set the Project Address of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Address { get; set; }
```
```vb
Public Property Address As String
	Get
	Set
```
```cpp
public:
property String^ Address {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Address : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Address of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace